---
kind: method
id: M:Autodesk.Revit.DB.CurveLoop.GetBasicIEnumerator
source: html/b55fa6c3-c8fe-38c5-877f-7fdfe3faf4b6.htm
---
# Autodesk.Revit.DB.CurveLoop.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.